package com.zyf.swtest;
import org.testng.annotations.*;
import transport.compute;


public class computetest {

    @DataProvider(name="visitor")
    public Object[][] computePara(){
        return new Object[][]{
                {"国内航线","头等舱", 1000, 60, 20,20,20, "成人", "金卡会员"},
                {"国内航线","头等舱", 1000, 50, 20,20,20, "成人", "金卡会员"},
                {"国内航线","头等舱", 1000, 50, 20,20,20, "成人", "银卡会员"},


                {"国内航线","头等舱", 1000, 25, 20,20,20, "占座婴儿", "金卡会员"},
                {"国内航线","头等舱", 1000, 35, 20,20,20, "占座婴儿", "金卡会员"},

                {"国内航线","头等舱", 1000, 15, 20,20,20, "占座婴儿", "银卡会员"},
                {"国内航线","头等舱", 1000, 25, 20,20,20, "占座婴儿", "银卡会员"},

                {"国内航线","头等舱", 1000, 5, 20,20,20, "占座婴儿", "非会员"},
                {"国内航线","头等舱", 1000, 15, 20,20,20, "占座婴儿", "非会员"},

                {"国内航线","头等舱", 1000, 35, 20,20,20, "成人", "非会员"},
                {"国内航线","头等舱", 1000, 45, 20,20,20, "成人", "非会员"},

                {"国内航线","公务舱", 1000, 45, 20,20,20, "成人", "金卡会员"},

                {"国内航线","公务舱", 1000, 35, 20,20,20, "成人", "银卡会员"},
                {"国内航线","公务舱", 1000, 45, 20,20,20, "成人", "银卡会员"},

                {"国内航线","公务舱", 1000, 25, 20,20,20, "成人", "非会员"},
                {"国内航线","公务舱", 1000, 35, 20,20,20, "成人", "非会员"},

                {"国内航线","经济舱", 1000, 35, 20,20,20, "成人", "金卡会员"},
                {"国内航线","经济舱", 1000, 45, 20,20,20, "成人", "金卡会员"},

                {"国内航线","经济舱", 1000, 25, 20,20,20, "成人", "银卡会员"},
                {"国内航线","经济舱", 1000, 35, 20,20,20, "成人", "银卡会员"},

                {"国内航线","经济舱", 1000, 15, 20,20,20, "成人", "非会员"},
                {"国内航线","经济舱", 1000, 25, 20,20,20, "成人", "非会员"},

        };
    }

    @Test(dataProvider = "visitor")
    public void computeTest(String road, String room , int price , int w, int x, int y, int z, String people, String vip){
        System.out.println(compute.computeMoney(road, room, price, w,x,y,z,people, vip));
    }
}
